$$ R_{t,t_1} = \frac{P_{t+1}-P_{t}}{P_{t}} $$

or alternately

$$ R_{t,t_1} = \frac{P_{t+1}}{P_{t}} - 1 $$

In [12]:
import numpy as np
import pandas as pd

In [14]:
prices_a = np.array([8.70, 8.91, 8.71])

In [15]:
prices_a[1:]/prices_a[:-1] - 1

array([ 0.02413793, -0.02244669])

In [16]:
prices = pd.DataFrame({"BLUE": [8.70, 8.91, 8.71, 8.43, 8.73],
                       "ORANGE": [10.66, 11.08, 10.71, 11.59, 12.11]})

prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [22]:
prices.iloc[1:].values/prices.iloc[:-1] - 1

       BLUE    ORANGE
0  0.024138  0.039400
1 -0.022447 -0.033394
2 -0.032147  0.082166
3  0.035587  0.044866

In [24]:
prices/prices.shift(1) - 1

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [25]:
prices.pct_change()

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [26]:
returns = prices.pct_change()

In [27]:
returns

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [33]:
(returns + 1).prod() - 1

BLUE      0.003448
ORANGE    0.136023
dtype: float64

## Annualization

In [35]:
rm = 0.01
(1+rm)**12 - 1

0.12682503013196977

In [36]:
rq = 0.04
(1+rq)**4 - 1

0.1698585600000002

In [37]:
rd = 0.0001
(1+rd)**252

1.0255189119876946